### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series?

In [4]:
import pandas as pd
 
data = [4, 8, 15, 16, 23]
 
ser = pd.Series(data)
ser

0     4
1     8
2    15
3    16
4    23
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
import pandas as pd
 
data = [2,4,6,8,10,12,14,16,18,20]
 
ser = pd.Series(data)
ser

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
9    20
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

In [14]:
# initialize list of lists
data = [['Alice', 25,'Female'], ['Bob', 30, 'Male'], ['Claire', 27,'Female']]

# Create the pandas DataFrame
df = pd.DataFrame(data)
  
# print dataframe.
df

        0   1       2
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example?

A DataFrame is a data structure that organizes data into a 2-dimensional table of rows and columns, much like a spreadsheet.

Series in pandas contains a single list which can store heterogeneous type of data, because of this, series is also considered as a 1-dimensional data structure.

Ex: data = [2,4,6,8,10,12,14,16,18,20]

DataFrame is a 2-dimensional data structure which contains multiple lists of heterogeneous type of data. DataFrame can contain multiple series or it can be considered as a collection of series.

Ex: data = [['Alice', 25,'Female'], ['Bob', 30, 'Male'], ['Claire', 27,'Female']]

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

some common functions use to manipulate data in a Pandas DataFrame are type(), sort_values(), merge(), dropna(), describe(), head(), merge()

In [13]:
# initialize list of lists
data = [['Alice', 25,'Female'], ['Bob', 30, 'Male'], ['Claire', 27,'Female']]

# Create the pandas DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age', 'Gender'])
  

df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrame and Panel are mutable in nature Series.

### Q7. Create a DataFrame using multiple Series. Explain with an example?

In [2]:
import pandas as pd
# Create pandas Series
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

# Combine two series.
df=pd.concat([courses,fees],axis=1)

# It also supports to combine multiple series.
df=pd.concat([courses,fees,discount],axis=1)
df

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000

By using concat() method you can merge multiple series together into DataFrame.

axis=1 to specify merge series as columns.

axis=0 appends series to rows.